A little of everything.
